Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/housing/owning_a_home/help_with_buying_a_home/index.html.txt.tmx
Source language: en
Languages: ga

source: Help with buying a home
ga: Cabhair maidir le teach a cheannach

source: A mortgage is a long-term financial commitment
ga: Ceangaltas fadtéarmach airgeadais is ea morgáiste

source: You need to assess your finances and ensure that you can manage the repayments
ga: Is gá duit do chuid airgeadais a mheasúnú agus a chinntiú gur féidir leat na haisíocaíochtaí a dhéanamh

source: The Central Bank has set limits on the size of residential mortgages
ga: Chuir an Banc Ceannais teorainneacha ar mhéid morgáistí cónaithe

source: Local authorities can provide mortgages to people who cannot get a loan from a building society or bank
ga: Is féidir le údaráis áitiúla morgáístí a chur ar fáil do dhaoine nach féidir leo iasacht a fháil ó chumann foirgníochta ná ó bhanc

source: An allowance of €11,450 over 5 years is payable to local authority tenants, tenant purchasers and some housing association tenants who take out a mortgage to buy or build a house
ga: Tá liúntas de 11,427.64 euro iníoctha thar tréimhse 5 bhliana le tionóntaí den údarás áitiúil nó le tionóntaí atá ag ceannach ón údarás nó tionóntaí de chumainn tithíochta faoi leith atá ag ceannach nó ag tógáil tí le morgáiste

source: Low cost housing sites
ga: Suíomhanna tithíochta ar chostas íseal

source: Local authorities may provide housing sites at low cost to help people in housing need to provide their own housing
ga: Is féidir le húdaráis áitiúla suíomhanna tithíochta a chur ar fáil ar chostas íseal, chun cabhrú le daoine a bhfuil tithíocht de dhíth orthu a gcuid tithíocht féin a chur ar fáil

source: A mortgage for first-time buyers who cannot get a mortgage or sufficient finance from a bank or a building society
ga: Morgáiste do cheannaitheoirí chéad uaire nach féidir leo morgáiste nó maoiniú a ndóthain a fháil ó na bainc ná ó na cumainn foirgníochta

source: This scheme enabled low-income purchasers to buy a proportion of a home to begin with, increasing in steps until the whole house was owned
ga: Chuir an scéim seo ar chumas ceannaitheoirí ísealioncaim comhréir de theach a cheannach le tosú amach, a d'imigh i méid de réir a chéile go dtí go raibh siad faoi lánúinéireacht an tí

source: It has now been stood down
ga: Tá deireadh curtha léi anois

source: The affordable housing schemes have been stood down
ga: Tá deireadh curtha leis na scéimeanna seo

source: They helped eligible first-time buyers to buy homes at below their market price
ga: Scéimeanna ab ea iad chun cuidíú le teaghlaigh ar ioncam íseal teach a cheannach

source: Most Read in "Housing"
ga: Ábhar is mó éilimh i "Tithíocht"

source: Applying for local authority/social housing
ga: Iarratas a dhéanamh ar thithíocht shóisialta/údaráis áitiúil

source: If your landlord wants you to leave
ga: Má theastaíonn ó do thiarna talún go bhfágfadh tú an teach nó an t-árasan
